#+TITLE: Yahtzee Analysis
#+AUTHOR: Rick Neff
#+EMAIL:  NeffR@byui.edu 
#+LANGUAGE:  en
#+OPTIONS:   H:4 num:nil toc:nil \n:nil @:t ::t |:t ^:t *:t TeX:t LaTeX:t
#+STARTUP: showeverything

****** Calculation

       (5 choose 2) = 5!/2!3! = 10 patterns

#+BEGIN_SRC elisp
  (let* ((num-patterns 10)
         (num-choices-for-a 6)
         (num-choices-for-b (- num-choices-for-a 1))
         (num-choices-for-c (- num-choices-for-b 1))
         (num-choices-for-d (- num-choices-for-c 1))
         (num-total (* num-patterns num-choices-for-a num-choices-for-b num-choices-for-c num-choices-for-d))
         (probability-of-outcome (/ num-total (float total))))
    (format "P(One Pair) = %d/%d = %2.5f" num-total total probability-of-outcome))
#+END_SRC

#+RESULTS:
: P(One Pair) = 3600/7776 = 0.46296


